Autodesk.Revit.DB.ViewDuplicateOption
Options for duplicating views
Since:
2013
Since:
2013

Autodesk.Revit.DB.ViewDuplicateOption.WithDetailing
Duplicate with Detailing

Autodesk.Revit.DB.ViewDuplicateOption.AsDependent
Duplicate as Dependent

Autodesk.Revit.DB.ViewDuplicateOption.Duplicate
Duplicate view